Repository: 84000/data-translation-memory
Catalog: Toh_152-The_Questions_of_Sagaramati-v2.tmx
Source language: bo
Languages: en

source: གཞན་ཡང་བཞི་སྟེ། ཚུལ་ཁྲིམས་ཀྱིས་དྲེགས་པ་དང་། མང་དུ་ཐོས་པས་དྲེགས་པ་དང་། དགོན་པ་ལ་གནས་པས་དྲེགས་པ་དང་། སྦྱངས་པའི་ཡོན་ཏན་དང་ཡོ་བྱད་བསྙུངས་པས་དྲེགས་པའོ། །
en: “There are another four: being arrogant because of one’s discipline, being arrogant because of one’s learning, being arrogant because of living in seclusion, and being arrogant because of one’s austere lifestyle and asceticism.

source: གཞན་ཡང་བཞི་སྟེ། བདག་ལ་བརྙས་པ་དང་། ཆོས་ལ་བརྙས་པ་དང་། དགེ་བའི་རྩ་བ་ཆུང་ངུ་ལ་བརྙས་ཏེ། བྱང་ཆུབ་ཏུ་ཡོངས་སུ་མི་བསྔོ་བ་དང་། སྐབས་སྐབས་སུ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་འདོད་པའོ། །
en: “There are another four: disparaging oneself, disparaging the Dharma, being contemptuous of lesser roots of virtue and failing to dedicate them to awakening, and feeling an occasional fondness for the vehicles of the hearers and solitary buddhas.

source: གཞན་ཡང་བཞི་སྟེ། ལུས་དེ་ལ་ཆགས་པ་དང་། སེམས་དེ་ལ་ཆགས་པ་དང་། ཚུལ་ཁྲིམས་དང་ཐོས་པ་དེ་ལ་ཆགས་པ་དང་། ཁྱད་པར་དུ་མི་འགྲོ་བའོ། །
en: “There are another four: attachment to the body, attachment to the mind, attachment to discipline and learning, and failing to excel.

source: གཞན་ཡང་བཞི་སྟེ། མཛའ་བོའི་ཁྱིམ་དང་། སློང་བ་སྟེར་བའི་ཁྱིམ་ཡོངས་སུ་འཛིན་པ་དང་། རྙེད་པ་དང་བཀུར་སྟི་ཡོངས་སུ་བཙལ་བ་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་འཆལ་པའི་ཚུལ་ཁྲིམས་ཡོངས་སུ་འཛིན་པ་དང་། གནས་ཡོངས་སུ་འཛིན་པ་དང་། ཚུལ་ཁྲིམས་དང་ལྡན་པ་ལ་ཞེ་སྡང་བས་ཡང་བའི་བྱ་བས་བཅིངས་པའོ། །
en: “There are another four: clinging to the homes of one’s relatives and those who give alms, clinging to erroneous discipline in order to pursue gain and praise, clinging to one’s place, and perpetuating negative actions because of aversion toward the disciplined life.

source: གཞན་ཡང་བཞི་སྟེ། བྱ་བ་མང་བ་དང་། རྙེད་པ་མང་བ་དང་། སྨྲ་བ་མང་བ་དང་། བཤེས་པ་མང་བའོ། །
en: “There are another four: excessive activity, excessive wealth, excessive conversation, and excessive acquaintances.

source: གཞན་ཡང་བཞི་སྟེ། བདག་ལ་མངོན་པར་ཞེན་པས་བདག་ཏུ་ལྟ་བ་དང་། སེམས་ཅན་ལ་མངོན་པར་ཞེན་པས་སེམས་ཅན་དུ་ལྟ་བ་དང་། བྱ་བ་མ་ཡིན་པ་ལ་མངོན་པར་ཞེན་པས་ཆད་པར་ལྟ་བ་དང་། སྲོག་དེ་དང་ལུས་དེ་ལ་མངོན་པར་ཞེན་པས་རྟག་པར་ལྟ་བའོ། །
en: “There are another four: the view of self because of clinging to the self, the view of beings because of clinging to beings, the view of nihilism because of clinging to inappropriate actions, and the view of eternalism because of clinging to the body and life force.

source: གཞན་ཡང་བཞི་སྟེ། རྩོམ་པ་རྒྱུན་གཅོད་པ་དང་། རྒྱུན་ཆད་པས་ཡང་དག་པར་རབ་ཏུ་མི་འཛིན་པ་དང་། ཡང་དག་པར་རབ་ཏུ་མ་བཟུང་བས་ཡོངས་སུ་སྐྱོ་བ་དང་། ཡོངས་སུ་སྐྱོ་བས་ལྡོག་ཅིང་འཇིག་པའོ། །
en: “There are another four: discontinuing one’s efforts, failing to uphold any efforts after having discontinued them, getting discouraged by failing to embrace one’s efforts, and reversing and destroying one’s progress by becoming discouraged.

source: གཞན་ཡང་བཞི་སྟེ། ས་ནས་སར་འཕར་བ་ལ་བརྙས་པ་དང་། བསམ་གཏན་ལས་ཟློག་པ་ལ་མི་མཁས་པ་དང་། སེམས་ཅན་ལ་མི་ལྟ་བར་ཤེས་རབ་ཀྱིས་རྣམ་པར་དཔྱོད་པ་དང་། དམིགས་པ་ཅན་དུ་གྱུར་ལ་ཐབས་ལ་ཁས་འཆེ་བའོ། །
en: “There are another four: disparaging the progress from level to level, being unskilled in exiting concentration, having insight without consideration for beings, and claiming to have skillful means while observing reference points.

source: བློ་གྲོས་རྒྱ་མཚོ་གཞན་ཡང་ཐེག་པ་ཆེན་པོའི་བར་ཆད་དུ་འགྱུར་བའི་ཆོས་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Sāgaramati, there are four more ways the Great Vehicle is obstructed. What are they?

source: ཆོས་ཀྱི་སྒྲིབ་པ་ཀུན་ནས་ལངས་པས་དམན་པ་དང་། ལས་ཀྱི་སྒྲིབ་པ་ཀུན་ནས་ལངས་པས་དགེ་བའི་རྩ་བ་རྣམས་ལ་མི་བརྩོན་པ་དང་། ཉོན་མོངས་པའི་སྒྲིབ་པ་ཀུན་ནས་ལངས་པས་ཕུང་པོ་གསུམ་གྱི་རྗེས་སུ་མི་འཇུག་པ་དང་། བདུད་ཀྱི་ལས་ཀུན་ནས་ལངས་པས་བྱང་ཆུབ་ཀྱི་སེམས་བརྗེད་པ་སྟེ།
en: They are: being base due to the manifestation of phenomenal obscurations, not pursuing roots of virtue due to the manifestation of karmic obscurations, not engaging with the three virtuous factors due to the manifestation of afflictive obscurations, and forgetting the mind of awakening due to the manifestation of the māras’ activities.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཐེག་པ་ཆེན་པོ་སྡུད་པ་འདི་བཤད་པ་ན་ལྷ་དང་མིའི་སྐྱེ་དགུའི་སྲོག་ཆགས་བཞི་ཁྲི་བཞི་སྟོང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་ཉི་ཁྲི་བརྒྱད་སྟོང་གིས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །
en: When the Blessed One spoke of the Great Vehicle, forty-four thousand gods and humans developed the mind directed toward unsurpassed and perfect awakening, and twenty-eight thousand bodhisattvas attained the acceptance that phenomena are unborn.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཡང་རྣམ་པ་དྲུག་ཏུ་གཡོས་ཏེ། སྣང་བ་ཆེན་པོས་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་གསལ་བར་གྱུར་ཏོ། །
en: The great trichiliocosm trembled six times and a great light illuminated the world.

source: སྟེང་གི་བར་སྣང་ལ་འཁོད་པའི་ལྷའི་བུ་བརྒྱད་སྟོང་དག་ཀྱང་ཨ་ལ་ལ་ཞེས་ཅ་ཅོ་དང་ག་ཞའི་སྒྲ་ཕྱུང་སྟེ། མེ་ཏོག་དག་གི་ཆར་ཡང་རབ་ཏུ་ཕབ། སིལ་སྙན་དང་གླུ་དབྱངས་ཀྱང་བྱས་ཏེ།
en: Eight thousand gods in the space above called out in wonder, laughter, and joy, and they cast a rain of flowers, played instruments, and sang.

source: ཀྱེ་མའོ་འདི་ནི་ཆོས་ཀྱི་གཏེར་ཆེན་པོ་སྟེ། དེ་བཞིན་གཤེགས་པས་ཕྱེ་བ་ཐུགས་རྗེ་ཆེན་པོ་ལ་གནས་ནས་སེམས་ཅན་ཐམས་ཅད་ལ་ཡང་དག་པར་རབ་ཏུ་བསྟན་པའོ། །
en: They remarked, “Hark! This is a great treasure of Dharma, which has been opened by the Thus-Gone One and revealed to all beings out of great compassion.

source: བཅོམ་ལྡན་འདས་དེ་ལ་ཆོས་རིན་པོ་ཆེའི་གཏེར་ཆེན་པོ་འདི་ལས་གང་གིས་ཐ་ན་ཆུང་ཟད་ཙམ་ཞིག་ཡོངས་སུ་འཛིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ངན་འགྲོར་རྣམ་པར་ལྟུང་བའི་འཇིགས་པ་རྣམས་ལས་ཡོངས་སུ་ཐར་བར་འགྱུར།
en: Blessed One, anyone who even slightly tries to uphold this great treasure of the precious Dharma will be freed from the fear of falling into the lower realms.

source: རིམ་གྱིས་ཆོས་ཀྱི་འཁོར་ལོ་རིན་པོ་ཆེ་བླ་ན་མེད་པ་རབ་ཏུ་བསྐོར་བར་འགྱུར་རོ། །
en: Gradually they will begin to turn the unsurpassed and precious wheel of Dharma.

source: འདི་ལྟ་སྟེ་དཔེར་ན། བཅོམ་ལྡན་འདས་སྐྱེས་བུ་ལ་ལ་ཞིག་གིས་གྲོང་ངམ་གྲོང་ཁྱེར་རམ་གྲོང་རྡལ་དང་ཧ་ཅང་ཡང་མི་རིང་བ་ཞིག་ན་གཏེར་ཆེན་པོའི་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་གཏམས་པ་བས་མི་འཚལ་བ་ཞིག་མཐོང་སྟེ། སྐྱེས་བུ་དེ་ཡང་ཕན་པའི་དངོས་པོ་ཕུན་སུམ་ཚོགས་པར་གྱུར་ལ།
en: “To draw an analogy, let us imagine, Blessed One, that a person who lived near a town, village, or city happened upon a hitherto undiscovered, immense treasure of all types of jewels, and that this person was someone who was very helpful to others.

source: དེས་གཏེར་ཆེན་པོ་དེ་མཐོང་ནས་ཀྱང་གྲོང་ངམ་གྲོང་ཁྱེར་རམ་གྲོང་རྡལ་དུ་མཆིས་ཏེ་སྐྱེ་བོའི་ཚོགས་ཕལ་པོ་ཆེ་ལ་བསྒོའོ་སྙམ་དུ་བསམས་ནས་
en: Having discovered that treasure, he then went to the town, village, or city with the intention to inform the public and said,

source: སྐྱེས་བུ་ཁྱོད་ཚུར་ཤོག །
en: ‘Everyone, come here!

source: ཁྱེད་ཀྱི་ནང་ནས་སུ་ལ་རིན་པོ་ཆེ་དགོས་པ་ལ་ངས་གཏེར་ཆེན་པོ་ཟད་མི་ཤེས་པ་དེ་བསྟན་པར་བྱའོ་ཞེས་བགྱིས་པ་དང་།
en: I will show this inexhaustible deposit to whoever needs jewels!’

source: བཅོམ་ལྡན་འདས་དེའི་ནང་ནས་ཁ་ཅིག་ནི་དེ་ལ་དད་པར་གྱུར། ཁ་ཅིག་ནི་དད་པར་མ་གྱུར་ལ།
en: Blessed One, some trusted him and some did not.

source: དེའི་ནང་ནས་གང་དག་དད་པར་གྱུར་པ་དེ་དག་གཏེར་ཆེན་པོའི་གན་དུ་མཆིས་ཏེ་
en: The ones who trusted him went to the deposit.

source: ཁ་ཅིག་ནི་སྟོབས་ཅི་ཙམ་པ་དེ་སྙེད་ཀྱི་རིན་པོ་ཆེ་རྣམས་འཚལ་ཏེ་མཆིས།
en: For some, there were as many jewels as they had strength to carry.

source: ཁ་ཅིག་ནི་ཇི་ལྟར་རྟོགས་པ་དེ་འདྲ་བའི་རིན་པོ་ཆེ་འཚལ་ཏེ་མཆིས་ཀྱང་གཏེར་ཆེན་པོ་དེ་བས་པར་མི་འགྱུར་ཞིང་འདི་དག་ལ་ནི་སྩལ་ཏོ། །
en: For some, there were as many jewels as they could imagine.

source: འདི་དག་ནི་མི་སྩལ་ཏེ། འདི་དག་ནི་འཚལ་ཀྱང་རུང་། འདི་དག་ནི་འཚལ་དུ་མི་རུང་ངོ་སྙམ་དུ་ཡོངས་སུ་མི་རྟོག་གོ། །
en: Yet the deposit itself had no concepts as to bestowing or not bestowing, or that it was appropriate to give to some and not to others.

source: བཅོམ་ལྡན་འདས་གཏེར་ཆེན་པོ་དེ་རྣམ་པར་མི་རྟོག་པའི་སླད་དུའོ། །
en: Because, Blessed One, this deposit held no concepts.

source: དེ་བཞིན་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་གྲངས་མ་མཆིས་པར་ཆོས་རིན་པོ་ཆེའི་གཏེར་ཆེན་པོ་བླ་ན་མ་མཆིས་པ་འདི་བསྒྲུབས་སོ། །བསྒྲུབས་ནས་ཀྱང་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །
en: “Likewise, the Blessed One accomplished the immense treasure of the precious Dharma over countless trillions of eons, whereupon he awakened to perfect buddhahood at the seat of awakening.

source: མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཀྱང་གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱི་དྲང་སྲོང་ལྷུང་བར་ཆོས་ཀྱི་འཁོར་ལོ་རིན་པོ་ཆེ་ཆེན་པོ་རབ་ཏུ་བསྐོར་ཏོ། །
en: He then turned the immense and precious wheel of Dharma in the city of Vārāṇasī at the Hill of Fallen Sages.

source: དེ་ལྟར་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་འདིར་འདུས་པ་ཆེན་པོའི་ལེའུའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཆོས་རིན་པོ་ཆེའི་གཏེར་ཆེན་པོ་བླ་ན་མ་མཆིས་པ་འདི་ཕྱེ་སྟེ།
en: In the same manner the Blessed One opened the unsurpassed and precious treasure of this collection of Dharma teachings.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བསྲི་བ་མི་མངའ་བའི་ཐུགས་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ལ་ཐུགས་རྗེ་ཆེན་པོའི་ཐུགས་བསྐྱེད་དེ།
en: The Blessed One developed great compassion for all beings with no distinction.

source: ཕན་པའི་དངོས་པོ་ཡང་དག་པར་བསྐྱེད་ནས་ཚངས་པའི་དབྱངས་ཀྱིས་གོ་བར་མཛད་པའི་གསུང་གིས་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ལ་ཚུར་ཤོག །
en: Arousing beneficial means, he spoke to the world of gods, humans, and asuras with the voice of Brahmā that engenders understanding, saying, ‘Come!

source: ཆོས་རིན་པོ་ཆེའི་གཏེར་ཆེན་པོ་བླ་ན་མེད་པ་སྐྱེ་བ་དང་རྒ་བ་དང་ན་བ་དང་འཆི་བའི་མཐར་འབྱིན་པ་ཟད་མི་ཤེས་པ་བདེ་བ་ཐམས་ཅད་སྦྱིན་པ་འདི་ལོང་ཤིག་ཅེས་
en: Take possession of this unsurpassed and immense treasure of the precious Dharma that is inexhaustible, bestows all forms of happiness, and transports one to the end of birth, aging, sickness, and death.’

source: གོ་བར་མཛད་པ་དེ་ལ་བཅོམ་ལྡན་འདས་སྐྱེས་བུ་གཏི་མུག་ཅན་མ་དད་པ་ཁ་ཅིག་ནི་མ་མོས་གློ་བ་མི་ཆེས་མི་རྟོག་ཅིང་དད་པར་མི་བགྱིད་དོ། །
en: Responding to your attempt to engender understanding, Blessed One, some beings who were stupid and had no faith were not inspired, interested, thoughtful, or trusting.

source: དད་པ་རྟོག་པའི་རང་བཞིན་ཅན་ཁ་ཅིག་ནི་མོས་ཤིང་གློ་བ་ཆེས། རྟོག་ཅིང་དད་པར་བགྱིད་དེ།
en: Those whose nature was capable of faith were inspired, interested, thoughtful, and trusting.

source: དེ་དག་གིས་དེ་བཞིན་གཤེགས་པའི་ཆོས་རིན་པོ་ཆེའི་གཏེར་ཆེན་པོ་ལས་ཅི་ནུས་ཅི་འོས་སུ་ཆོས་རིན་པོ་ཆེ་ལེན་ཅིང་
en: They partook what they could of the Thus-Gone One’s immense treasure of the precious Dharma.

source: ཐེག་པ་ལ་ཇི་ལྟར་མོས་པ་བཞིན་དུ་རྣམ་པར་འགྲེལ་ཏེ།
en: He explained the vehicle that inspired them.

source: ཁ་ཅིག་ནི་ཉན་ཐོས་ཉིད་ཀྱི་སླད་དུ། ཁ་ཅིག་ནི་རང་སངས་རྒྱས་ཉིད་ཀྱི་སླད་དུ། ཁ་ཅིག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་སླད་དུ་ཞུགས་ཀྱང་དེ་བཞིན་གཤེགས་པའི་ཆོས་རིན་པོ་ཆེའི་གཏེར་ཆེན་པོ་བླ་ན་མ་མཆིས་པ་ནི་ཡོངས་སུ་བས་པར་མི་འགྱུར་ཞིང་ཡོངས་སུ་མི་རྟོག་གོ། །
en: Some entered seeking the state of hearers, solitary buddhas, or unsurpassed and perfect awakening. Yet, the Thus-Gone One’s unsurpassed and immense treasure of the precious Dharma had no concepts about anyone.

source: བཅོམ་ལྡན་འདས་དེ་ལ་གང་གིས་དེ་བཞིན་གཤེགས་པའི་ཆོས་རིན་པོ་ཆེའི་གཏེར་ཆེན་པོ་འདི་ལྟར་རབ་ཏུ་བཏང་བ་འདི་ལྟར་རྣམ་པར་ཕྱེ་བ་འདི་ལས་ཐ་ན་གང་ཆུང་ཟད་ཙམ་ཡང་མི་འཛིན་པ་དེ་དག་རིན་པོ་ཆེ་ལས་ཡོངས་སུ་ཉམས་ཤིང་རིན་པོ་ཆེ་ལས་སླད་རོལ་དུ་གྱུར་ཏེ
en: “Blessed One, those who give up the Thus-Gone One’s immense treasure of the precious Dharma or do not uphold this revelation even slightly will lose these jewels and find themselves bereft of them.

source: ཡུན་རིང་པོར་ངན་སོང་གསུམ་པོ་དག་ལ་དགའ་བར་འགྱུར་རོ། །
en: They will find themselves in the three lower realms for a long time.

source: བཅོམ་ལྡན་འདས་གང་དག་ཆོས་རིན་པོ་ཆེའི་གཏེར་ཆེན་པོ་འདི་ལས་ཐ་ན་ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་ཙམ་འཛིན་པ་དེ་དག་ནི་འཕགས་པའི་ནོར་དང་ལྡན་ཏེ་དབུལ་པོ་མ་ལགས་ན།
en: Blessed One, if anyone who upholds even a single four-line verse of this immense treasure of the precious Dharma will become wealthy and receive the seven riches of noble beings,

source: གང་འདུས་པ་ཆེན་པོའི་ལེའུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལས་ཐ་ན་ལེའུ་གཅིག་ཙམ་འཛིན་ཏམ། གཉིས་སམ། གསུམ་འམ། བཞིའམ། ལྔའམ། བཅུའམ། ཉི་ཤུའམ། སུམ་ཅུའམ། བཞི་བཅུའམ། ལྔ་བཅུའམ། དྲུག་ཅུའམ། བདུན་ཅུའམ། མཐའ་དག་རྫོགས་པར་འཛིན་པ་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ་ཏེ
en: then what need have we to speak of those who uphold a complete chapter of this collection of Dharma teachings—or two, three, four, five, ten, twenty, thirty, forty, fifty, sixty, or seventy chapters, or the entire teaching?

source: སྐྱེས་བུ་དམ་པ་དེ་དག་གི་བསོད་ནམས་ཀྱི་མཐའ་རྟོགས་པར་མི་ནུས་སོ། །
en: The extent of those sublime beings’ merit could not be fathomed.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་ཀྱི་སེམས་དང་མ་བྲལ་བ། སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་ཆེན་པོས་རབ་ཏུ་ནོན་པ་གང་དག་ཆོས་ཀྱི་སྒོའི་ལེའུ་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་པ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་དང་།
en: Blessed One, anyone who has not lost the mind of awakening and is moved by great compassion for beings, and who then upholds, retains, reads, understands, and teaches it extensively to others, will be prophesied to awaken to unsurpassed and perfect buddhahood.

source: དེ་དག་བདུད་ཆོམས་པ་དང་། དེ་དག་ཐེག་པ་ཆེན་པོ་འདི་ལ་མངོན་པར་ཤེས་པ་ཐོབ་པར་རིག་པར་བགྱིའོ་ཞེས་ཆེད་དུ་བརྗོད་པ་ཆེད་དུ་བརྗོད་དོ། །
en: They will defeat the māras and gain attainment of super-knowledge within this Great Vehicle.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་བུ་དེ་དག་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: The Blessed One then expressed his approval to the gods, saying,

source: ལྷའི་བུ་དག་ཚིག་འདི་ལེགས་པར་སྨྲ་བ་ལེགས་སོ་ལེགས་སོ། །
en: “Gods, these words have been well said. Excellent, excellent.

source: གང་དག་ཆོས་ཀྱི་སྒོའི་ལེའུ་འདི་ཉན་པ་དང་། ཐོས་ནས་ཀྱང་མོས་པ་དང་། མོས་ནས་ཀྱང་ལེན་པ་དང་། འཛིན་པ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། དེ་བཞིན་ཉིད་དུ་སྒྲུབ་པའི་སྐྱེས་བུ་དམ་པ་དེ་དག་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་གཞོལ་བར་བལྟ།
en: You see how any sublime being who hears this gateway to the Dharma, becomes inspired, and subsequently takes it up, upholds it, reads it, masters it, and accomplishes it will alight upon the seat of awakening.

source: དེ་དག་ཡོན་ཏན་ཐམས་ཅད་ལ་གནས་པར་བལྟ།
en: You see how they possess all qualities.

source: དེ་དག་ཐམས་ཅད་མཁྱེན་པའི་གཙུག་ཏུ་ཕྱིན་པ་དང་། འཇིག་རྟེན་གནས་པ་ལོང་བ་ལ་ཤེས་རབ་ཀྱི་སྒྲོན་མ་བྱེད་པ་དག་ཏུ་བལྟ་སྟེ།
en: You see how they reach the peak of omniscience and act as a lamp of insight for those blinded in the world.

source: དེ་དག་རིང་པོར་མི་ཐོགས་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །
en: Before long, they will fully awaken to unsurpassed and perfect buddhahood.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟ་སྟེ།
en: Why is this so?

source: དེ་དག་ཐེག་པ་ཆེན་པོའི་ཐེག་པ་ལ་ཞོན་པའི་ཕྱིར་རོ། །
en: Because they ride the vehicle that is the Great Vehicle.”

source: སངས་རྒྱས་ཐེག་པ་ཆེན་པོའི་ཐེག་འདི་ཁྱད་པར་འཕགས། །
en: “The buddhas’ vehicle of the Great Vehicle is extraordinarily noble.

source: ནམ་མཁའི་དཀྱིལ་དང་འདྲ་སྟེ་འཇིག་རྟེན་ཀུན་ལས་འདས། །
en: Like the sphere of space, it transcends the world.

source: སྲིད་པ་གསུམ་ལས་འདས་ནས་བྱང་ཆུབ་སྙིང་པོར་འགྲོ། །
en: Those who transcend the three realms of existence, go to the seat of awakening.

source: ཆགས་པ་མེད་དེ་ཆགས་པ་ཀུན་ལས་ཤིན་ཏུ་འདས། །
en: They eliminate desire—indeed, they transcend all desire.

source: སྦྱིན་དང་དུལ་དང་ཞི་དང་ཚུལ་བཞིན་བསམ་པ་ཡིས། །བསྐལ་པ་བྱེ་བར་རྒྱ་ཆེན་ལས་བྱུང་བསགས་པར་བརྗོད། །
en: “It’s said that over billions of eons They amass generosity, discipline, peace, and contemplation.

source: ཚུལ་ཁྲིམས་ཀྱིས་ནི་སྡིག་བསལ་ལུས་དང་ངག་དང་སེམས། །སྲིད་པ་ཐམས་ཅད་བོར་ནས་བྱང་ཆུབ་སྙིང་པོར་འགྲོ། །
en: They dispel evil with discipline and with body, speech, and mind, Cast aside existence to arriving at the seat of awakening.

source: མཉམ་ཞིང་རྗེས་སུ་མཉམ་སེམས་སེམས་ཅན་ཀུན་སྐབས་འབྱེད། །དེ་ལས་གཞན་པའི་ཐེག་དམན་ཇི་སྙེད་ཟིལ་གྱིས་གནོན། །
en: “They discern beings’ situations with an unbiased mind And outshine all other lesser vehicles.

source: གང་དག་རྫུ་འཕྲུལ་རྐང་གི་རི་རབ་རྒྱལ་མཚན་མཐོ། །ཐེག་པ་ཆེན་པོར་འགྲོ་ཞིང་སེམས་ཅན་ཚིམ་པར་བྱེད། །
en: With their standards held high, and the mountain-like bases of miracles, They progress through the Great Vehicle and bring satisfaction to beings.

source: ཐོས་དང་དུལ་བར་ལྡན་ཞིང་བསམ་གཏན་ཚུལ་ཁྲིམས་ལྡན། །བཟོད་སྟོབས་རབ་ཏུ། །ཐོབ་ཅིང་ཤེས་རབ་དབང་བསྐུར་བ། །
en: “Possessing hearing and training, concentration and discipline, They acquire the power of patience and master insight.

source: ཕ་རོལ་ཚོགས་རྣམས་བཅོམ་ཞིང་བདུད་ཀྱི་སྡེ་སྤངས་ནས། །ཆགས་མེད་ཐེག་པ་ཆེ་དང་བྱང་ཆུབ་སྙིང་པོར་འགྲོ། །
en: Defeating their opponents, and leaving behind the hordes of Māra, Their nonattachment is elevated and they travel to the seat of awakening.

source: བྱམས་པའི་གོ་ཆའི་ཆོས་ཀྱི་དགྲ་ཡིས་ཐུབ་པར་དཀའ། །
en: “Their armor of love makes it difficult for the enemies of the Dharma to conquer them.

source: ཆོས་དང་ལྡན་ནས་སྙིང་རྗེ་ཆེན་པོར་རིམ་གྱིས་འགྲོ། །བསམ་གཏན་རྫུ་འཕྲུལ་རྐང་དང་ཚད་མེད་བཞོན་པ་སྟེ། །
en: They gradually arrive at great compassion armed with the Dharma, Riding concentration, the bases of miracles, and the immeasurables.

source: ལམ་དེ་མི་འདོར་ཁ་ལོ་བསྒྱུར་བ་བྱང་ཆུབ་སེམས། །
en: These captains of the mind of awakening shall never give up this path.

source: ཕྱོགས་བཅུ་མཐའ་ཡས་སེམས་ཅན་ཁམས་རྣམས་ཇི་སྙེད་པ། །ཐེག་པ་ཆེན་པོ་འདི་ལ་བསྐྱོན་པ་ཐམས་ཅད་ནི། །གནོད་པ་མེད་ཅིང་འགྲིབ་པ་མེད་ཅིང་གང་བ་མེད། །
en: “All beings in all the limitless worlds of the ten directions Shall be mounted on the Great Vehicle, And experience no harm, decrease, or increase—

source: བདེ་བར་གཤེགས་ཀྱི་ཐེག་པའི་ཆོ་འཕྲུལ་འདི་འདྲའོ། །
en: This is the miracle of the blissful ones’ vehicle.

source: དྲན་གནས་ཡང་དག་སྦྱོར་དང་སྤོང་བ་བཞི་དག་དང་། །རྫུ་འཕྲུལ་རྐང་པ་བཞི་དང་དབང་པོ་སྟོབས་རྣམས་དང་། །རྒྱལ་བས་བསྔགས་པའི་བྱང་ཆུབ་ཡན་ལག་རིན་ཆེན་བདུན། །ལམ་གྱིས་འགྲོ་བར་ལྡན་པ་བྱང་ཆུབ་སྙིང་པོར་འགྲོ། །
en: “All who walk the path—practicing mindfulness, proper application, The four abandonments, the four bases of miracles, the faculties, the strengths, And the seven precious branches of awakening praised by the victors— Will travel to the seat of awakening.

source: ཞི་གནས་ཉོན་མོངས་ཞི་ཞིང་ཆོས་ལ་སྣང་བར་འགྱུར། །
en: “Tranquility pacifies the afflictions and illuminates the Dharma.

source: རྡུལ་དང་མུན་པ་བསལ་ནས་སྲིད་པ་གསུམ་ན་མཛེས། །
en: Grit and darkness dispelled, the three realms of existence are beautiful.

source: བརྒྱ་བྱིན་དང་ནི་ཚངས་པས་སྤྱི་བོས་ཕྱག་བྱས་ཏེ། །ལེགས་སོ་མཚུངས་མེད་ཐེག་འདིར་ཀུན་གྱིས་བཞོན་པར་བགྱི། །
en: Śakra and Brahmā bow their heads, expressing their approval, And they all enter the unequaled vehicle.

source: ཕ་རོལ་ཕྱིན་པ་གང་དག་སྦྱིན་ཚུལ་བཟོད་པ་དང་། །བརྩོན་འགྲུས་བསམ་གཏན་ཤེས་རབ་ཡེ་ཤེས་མངོན་པར་ཤེས། །དེ་བཞིན་ཐབས་དང་བསྡུ་བ་སྙིང་པོ་ལྡན་པ་སྟེ། །བདུད་རྣམས་བརྒྱ་སྟོང་གིས་ཀྱང་གདུལ་ཕྱིར་ཐུབ་པ་མེད། །
en: “Those who have the perfections—generosity, discipline, patience, Diligence, concentration, insight, wisdom, super-knowledge, And also skillful means and the essential means of attracting— Cannot be defeated by even hundreds of thousands of māras.

source: སེམས་ཅན་གང་དག་ཚུལ་ངན་སྡིག་ལས་བརྩོན་པ་དང་། །བྱང་ཆུབ་སེམས་དཔའ་གང་དག་ཡོན་ཏན་བརྒྱས་འཕགས་དང་། །གང་དག་བྱང་ཆུབ་སེམས་ཀྱི་སེམས་རྒྱ་ཆེར་གྱུར་པ། །ཀུན་ཀྱང་ཐེག་པ་མཆོག་ལ་ཞུགས་ནས་མཉམ་པར་མཐོང་། །
en: “Those who let the mind of awakening develop— Whether a being diligent in evil ways, Or a bodhisattva ennobled by thousands of virtues— Shall be considered equals when they enter the supreme vehicle.

source: གང་དག་སྣ་ཚོགས་སྔགས་དང་འཇིག་རྟེན་དོན་ལྡན་དང་། །གང་དག་དགེ་ཆོས་ཡང་དག་འཇིག་རྟེན་འདས་གྱུར་པ། །སློབ་དང་མི་སློབ་གང་དག་རང་རྒྱལ་རྣམས་ཀྱི་དང་། །སྒོ་དེར་སངས་རྒྱས་ཐེག་པ་ཆེ་བའི་བདག་ཉིད་ཞུགས། །
en: “Anyone at all—those who use different mantras with worldly aims, Those trying to transcend the world with virtuous qualities Or even solitary buddhas, whether they train or not— Can enter into the greatness of the buddhas’ vehicle through this door.

source: གང་དག་ཉོན་མོངས་རྣམ་མང་སྣ་ཚོགས་སེམས་ལྡན་དང་། །སྡུག་བསྔལ་སེམས་ཅན་གང་དག་འདུས་བྱས་འཁོར་གྱུར་པ། །དེ་དག་ཤིན་ཏུ་རབ་ཏུ་ཞི་བར་བྱེད་ཅིང་འགྲོ། །
en: “Even those whose minds are rife with afflictions, Beings mired in suffering, cycling in conditioned existence, Can be brought to absolute peace.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐེག་པ་མཆོག་ལ་གནས་ནས་སྟོན། །
en: The bodhisattvas teach them while living by the supreme vehicle.

source: ལེ་ལོ་ཅན་གྱི་མི་གང་ཉམ་ཆུང་མཐུ་ཞན་ལ། །སེམས་ཅན་སྡུག་བསྔལ་ཟད་པར་བྱ་ཕྱིར་སེམས་མི་བསྐྱེད། །བདག་བདེ་ཚོལ་གྱི་སེམས་ཅན་དོན་ལ་མི་བརྩོན་པ། །དེ་དག་ཐེག་པ་མཆོག་ཐོས་ནས་ནི་སེམས་སྐྲག་འགྱུར། །
en: “Lazy folk who never arouse the wish to exhaust the suffering Of beings tired and weak, Who seek their own pleasure at the cost of the welfare of beings, Will be terrified when they hear the supreme vehicle’s approach.

source: བྱང་ཆུབ་སེམས་དཔའ་མཁས་གསལ་བདག་ཉིད་ཆེན་པོ་གང་། །བརྩོན་འགྲུས་སྟོབས་ལྡན་རྟག་ཏུ་སེམས་ཅན་དོན་བརྩོན་ལ། །སྙིང་རྗེ་ཆེ་དང་ལྡན་ཞིང་བསམ་པ་དག་གྱུར་ལ། །དེ་དག་རབ་ཏུ་དགའ་བའི་སེམས་ཀྱིས་ཐེག་མཆོག་ཞོན། །
en: “Bodhisattvas—great beings of skill and clarity, Strong in diligence and always seeking the benefit of beings, Compassionate and contemplative— They will ride the supreme vehicle with absolute joy.

source: ཐེག་པ་མཆོག་རབ་གྱ་ནོམ་གཙོ་བོ་འདིར་གནས་ཏེ། །འཇིག་རྟེན་ཀུན་གྱི་སྤྱོད་རྣམས་མཐའ་ཡས་ཇི་སྙེད་དང་། །དབང་པོ་ཐ་མ་འབྲིང་དང་རབ་དང་བསམ་པ་རྣམས། །སྤྱོད་ཀུན་བྱང་ཆུབ་སེམས་དཔས་སྐད་ཅིག་ཙམ་ལས་ཤེས། །
en: “In a single moment all bodhisattvas Who uphold the supreme vehicle, primary and sublime, Can fathom the infinite actions found in every world, And every thought and deeds of those with lowest, middling, and highest faculties.

source: རླབས་པོ་ཆེ་ཡི་ཐེག་པ་མཆོག་འདིར་གནས་ནས་ནི། །དེ་ཡི་ལུས་ཀྱི་ཡན་ལག་མཚན་གྱིས་བརྒྱན་པར་འགྱུར། །
en: “Those who live by this supreme and powerful vehicle Will have bodies ornamented with the major marks.

source: ཚིག་སྙན་ཡིད་དུ་འོང་ཞིང་འཇིག་རྟེན་ཀུན་ཚིམ་བྱེད། །
en: Their words will be sonorous and pleasing—satisfying the whole world.

source: སེམས་ཡིད་རྣམ་དག་བསམ་གཏན་མངོན་ཤེས་ལྡན་པར་འགྱུར། །
en: They will achieve purity of mind, concentration, and super-knowledge.

source: འདི་ལས་རྒྱལ་བ་རྣམས་ཀྱི་སངས་རྒྱས་ཚུལ་མི་འཆད། །
en: “One doesn’t discuss a way to buddhahood of the victors apart from this.

source: འདི་ལས་ཆོས་ཚུལ་གྱ་ནོམ་ཚུལ་ཡང་རབ་ཏུ་འབར། །
en: From this, the sublime way of the Dharma also blazes forth.

source: འདི་ལས་འགྲོ་བའི་སྦྱིན་གནས་དགེ་འདུན་འབྱུང་བར་འགྱུར། །
en: From this comes the Saṅgha—worthy recipients of beings’ offerings.

source: དེས་ན་སངས་རྒྱས་ཐེག་འདི་འཇིག་རྟེན་གསུམ་དུ་གྲགས། །
en: Thus, this buddha vehicle is renowned throughout the three worlds.

source: ཐེག་པ་འདི་ནི་སྟོང་པའི་ཞིང་དུ་མི་འགྲོ་སྟེ། །
en: “The victors do not go to any realm where this vehicle is lacking.

source: རྒྱལ་བ་རྣམས་ཀྱི་འདི་ནི་སྐད་ཅིག་མི་སྣང་འགྲོ། །
en: They can vanish in an instant.

source: ཕྱོགས་བཅུར་སོང་ཡང་ཡོངས་སུ་མི་སྐྱོ་འགྲིབ་པ་མེད། །
en: Though they appear throughout the ten directions, they are not saddened or obscured.

source: མཚུངས་པ་མེད་པའི་ཐེག་པའི་ཆོ་འཕྲུལ་ཅི་འདྲ་ལྟོས། །
en: Consider how miraculous this unequaled vehicle is!

source: འཇིག་རྟེན་ཀུན་ཏུ་བསྐོར་ཀྱང་གང་ཞིག་དེ་འདྲ་འམ། །དེ་ལས་ལྷག་པར་འགྱུར་བའི་སེམས་ཅན་དེ་མི་རྙེད། །
en: “Though you may circle the entire world, You will never find a being greater than they.

source: བྱང་ཆུབ་སེམས་དཔའ་ཆེ་ཉིད་འགྲོ་བའི་དཔའ་བོ་གཅིག །ཐེག་པ་མཆོག་ལ་གནས་ནས་བདུད་སྡེ་སྐྲག་པར་བྱེད། །
en: An eminent and heroic bodhisattva Lives by the supreme vehicle and terrifies Māra’s hordes.

source: ཐེག་པ་མཆོག་ལ་གནས་ནས་གཟུགས་དང་སྟོབས་མཐུ་དང་། །ལོངས་སྤྱོད་དབང་ཕྱུག་ཐོབ་ཅིང་བརྒྱ་བྱིན་ཚངས་པ་དང་། །འཁོར་ལོས་སྒྱུར་དང་སྐྱོང་དང་གང་ཡང་སྲིད་གསུམ་ན། །
en: “One who lives by the supreme vehicle will gain physical strength and power, Wealth and riches, and the status of Śakra, Brahmā, Universal monarchs, and the guardians of the world.

source: ལྷ་དང་མི་ཡི་བདེ་སྐྱིད་སྐྱིད་པ་ཐམས་ཅད་འཐོབ། །
en: While in the three realms of existence, they will have the joys of the gods and humans.

source: ཐེག་པ་མཆོག་ལ་གནས་ནས་སེམས་ཞུམ་བརྒྱ་ལམ་མེད། །
en: “It rarely happens that followers of the supreme vehicle are discouraged.

source: གོང་བ་མེད་ལ་ཕངས་ཤིང་ཕངས་པ་རྣམས་ཀྱང་གཏོང་། །
en: They are free from restraint and relinquish all valuables.

source: བྱིན་ནས་ཞུམ་པ་མེད་ཅིང་མིག་དང་མགོ་བཏང་ནས། །དགའ་ཞིང་བྱམས་པའི་སེམས་སུ་གྱུར་ཏེ་བྱང་ཆུབ་འགྲོ། །
en: They are undiscouraged in giving, and when giving even their heads or eyes Their minds are joyful and loving, and so they proceed toward awakening.
